package com.example.hassanalhawary.domain.model

import android.icu.util.Calendar
import java.util.Date

data class Article(
    val id: String,
    val title: String,
    val contentSnippet: String = "",
    val publishDate: Date = Date(),
    val fullContent: String,
)



// Fake data generation
 fun getFakeArticles(): List<Article> {
    val calendar = Calendar.getInstance()
    return List(20) { index ->
        calendar.set(2023, Calendar.NOVEMBER, 20 - index) // Varying dates
        Article(
            id = "article_$index",
            title = "سبع وقفات مع الحرب الصهيو أمريكية ـ الإيرانية",
            contentSnippet = "✍\uFE0F فهذه تعليقات في وقفات على الحرب الإيرانية الصهيونية، أقول وبالله التوفيق:\n" +
                    "\n" +
                    "▫\uFE0Fالوقفة الأولى: وقوع هذه الحرب:\n" +
                    "\n" +
                    "هذه الحرب وإن تحاشتها الأطراف، لكنها وقعت بقدر الله وقضائه، فإن ما شاء الله كان، وما لم يشأ لم يكن، {وَكَانَ أَمْرُ اللَّهِ قَدَرًا مَقْدُورًا} [الأحزاب: ٣٨]، وله سبحانه في ذلك حِكَم، وهو الحكيم العليم، وهذا لا ينفي العوامل التي ساهمت في وقوعها، والأسباب التي أدت إلى...",
            publishDate = calendar.time,
            fullContent = "الحمد لله الملك الجبار، يكور النهار على الليل، ويكور الليل على النهار، يقضي ما يشاء لا راد لقضائه، ولا معقب لحكمه، {وَرَبُّكَ يَخْلُقُ مَا يَشَاءُ وَيَخْتَارُ} [القصص: ٦٨]، وصلّ اللهم وسلّم على النبي محمد إمام المصطفين الأخيار، وآله وصحبه الأكرمين الأطهار، وبعد:\n" +
                    "\n" +
                    "✍\uFE0F فهذه تعليقات في وقفات على الحرب الإيرانية الصهيونية، أقول وبالله التوفيق:\n" +
                    "\n" +
                    "▫\uFE0Fالوقفة الأولى: وقوع هذه الحرب:\n" +
                    "\n" +
                    "هذه الحرب وإن تحاشتها الأطراف، لكنها وقعت بقدر الله وقضائه، فإن ما شاء الله كان، وما لم يشأ لم يكن، {وَكَانَ أَمْرُ اللَّهِ قَدَرًا مَقْدُورًا} [الأحزاب: ٣٨]، وله سبحانه في ذلك حِكَم، وهو الحكيم العليم، وهذا لا ينفي العوامل التي ساهمت في وقوعها، والأسباب التي أدت إلى نشوبها كما سيأتي ذكره، وكل ذلك لا يخرج عن قضاء الله وقدره.\n" +
                    "\n" +
                    "▫\uFE0Fالوقفة الثانية: انهيار المؤسسات الدولية:\n" +
                    "\n" +
                    "كل متابع لما يدور في عالمنا اليوم منذ فترة يعلم يقينًا انهيار المؤسسات الدولية، والتشريعات والقوانين التي كان يتعامل بها العالم، وتنكُّر الدول الكبرى للتشريعات الأممية؛ مثل مواثيق الأمم المتحدة التي تنص على الحد من الحروب، وحماية السلم والأمن الدوليين، وتشرّع التعامل معها إذا نشبت، ومثل اتفاقيات جنيف الأربعة في حماية المدنيين حال نشوب الحرب، والقانون الدولي الإنساني؛ كل هذا بسبب كفرهم وضلالهم وتخبطهم في دياجير الظلام، من غير وحي يهديهم، ولا كتاب ينير لهم الطريق، وافتقارهم إلى الوازع الديني والعقل الراجح والحكمة والأخلاق، وقد زادهم غرورًا امتلاكهم القوة العسكرية؛ حتى أعادوا مقولة أسلافهم كما حكى ربنا سبحانه عنهم: {فَأَمَّا عَادٌ فَاسْتَكْبَرُوا فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَقَالُوا مَنْ أَشَدُّ مِنَّا قُوَّةً} [فصلت: ١٥]؛ فما عادت تلك الدول تراعي القوانين والمواثيق، إلا ما كان في مصلحتهم، وغدت أكثر وحشية ودموية وانحطاطًا وظلمًا وطغيانًا؛ فلا يرون إلا مصالحهم وإن كانت على حساب الدماء، والأرواح، وتناثر الأشلاء، والإبادة الجماعية، ومخالفة المواثيق والقوانين الدولية. \n" +
                    "\n" +
                    "⚠\uFE0F وإني لأرى أنّ هذا نذير تغيّر كبير سيحلّ بأهل الأرض؛ فإن سنن الله في الظلمة والطغاة والكفرة الجبابرة لا تتغير، قال الله سبحانه في الرد على قوم عاد المتجبرين: {أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً وَكَانُوا بِآيَاتِنَا يَجْحَدُونَ} [فصلت: ١٥]، وقال الله سبحانه عن فرعون وقومه: {فَلَمَّا آسَفُونَا انْتَقَمْنَا مِنْهُمْ فَأَغْرَقْنَاهُمْ أَجْمَعِين} [الزخرف:٥٥]، وقال: {وَأَخَذَتِ الَّذِينَ ظَلَمُوا الصَّيْحَةُ فَأَصْبَحُوا فِي دِيَارِهِمْ جَاثِمِينَ} [هود: ٩٤]، وقال: {فَكُلًّا أَخَذْنَا بِذَنْبِهِ فَمِنْهُمْ مَنْ أَرْسَلْنَا عَلَيْهِ حَاصِبًا وَمِنْهُمْ مَنْ أَخَذَتْهُ الصَّيْحَةُ وَمِنْهُمْ مَنْ خَسَفْنَا بِهِ الْأَرْضَ وَمِنْهُمْ مَنْ أَغْرَقْنَا وَمَا كَانَ اللَّهُ لِيَظْلِمَهُمْ وَلَكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ} [العنكبوت: ٤٠]، وقال عن قارون لما طغى وتغطرس: {فَخَسَفْنَا بِهِ وَبِدَارِهِ الْأَرْضَ فَمَا كَانَ لَهُ مِنْ فِئَةٍ يَنْصُرُونَهُ مِنْ دُونِ اللَّهِ وَمَا كَانَ مِنَ الْمُنْتَصِرِينَ} [القصص: ٨١].\n" +
                    "\n" +
                    "\uD83D\uDC48 فالعالم في ظني على شفا هلكة، وعلى موعد مع دمار وشيك، وخراب عاجل؛ فقد أفرطت الدول النافذة في الظلم والقتل، وطفح الكيل وبلغ السيل الزُّبَى، قال رسول الله صلَّى اللهُ عليه وسلم: «إِنَّ اللَّهَ لَيُمْلِي لِلظَّالِمِ حَتَّى إِذَا أَخَذَهُ لَمْ يُفْلِتْهُ» قَالَ: ثُمَّ قَرَأَ: {وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ القُرَى وَهِيَ ظَالِمَةٌ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ} [هود: ١٠٢].\n" +
                    "\n" +
                    "\uD83D\uDCD6 رواه البخاري.\n" +
                    "\n" +
                    "▫\uFE0Fالوقفة الثالثة: مشروع الدول الكبرى الحديث:\n" +
                    "\n" +
                    "واضح أن ما يعرف بالدول العظمى -وخاصة أمريكا والغرب- عازمة على إعادة تقسيم العالم وفق مصالحها، والهيمنة عليه بعد تقسيمه، خاصة المنطقة العربية الإسلامية (المشرق العربي)، بجانب البلاد الإسلامية الأخرى، والإفريقية عامة، كما قسمته من قبل في اتفاقية (سايكس – بيكو 1916م)، وتستعين هذه المرة ببعض العملاء، والعمل الاستخباري الذي تطور بتطور التقنية الحديثة تطورًا مذهلًا حتى أصبح العالم مكشوفًا بالنسبة لهم؛ فالدول الفاعلة والنافذة من دول الكفر والطغيان تسعى للسيطرة على موارد العالم، وتسلك في سبيل ذلك السبل المحرمة شرعًا والمُجرَّمة قانونًا، فتحارب بنفسها ووكلائها للوصول إلى أهدافها.\n" +
                    "\n" +
                    "⛔ هكذا يعتمدون على عملائهم وقوتهم وتطور التقنية لديهم، وللأسف لا يلوح في الأفق أي تضامن لبلاد المسلمين، وتنسيق لمواجهة هؤلاء الأعداء الفجرة الظلمة، فالله المستعان، وحسبنا الله عليهم، {وَيَمْكُرُونَ وَيَمْكُرُ اللَّهُ وَاللَّهُ خَيْرُ الْمَاكِرِينَ} [الأنفال: ٣٠]، {أَوَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ كَانُوا أَشَدَّ مِنْهُمْ قُوَّةً وَأَثَارُوا الْأَرْضَ وَعَمَرُوهَا أَكْثَرَ مِمَّا عَمَرُوهَا} [الروم: ٩]، وسوف لن تغني عنهم تقنيتهم وقوتهم إذا جاء أمر الله، قال الله سبحانه: {فَمَا أَغْنَتْ عَنْهُمْ آلِهَتُهُمُ الَّتِي يَدْعُونَ مِنْ دُونِ اللَّهِ مِنْ شَيْءٍ لَمَّا جَاءَ أَمْرُ رَبِّكَ وَمَا زَادُوهُمْ غَيْرَ تَتْبِيبٍ} [هود:١٠١]. \n" +
                    "\n" +
                    "▫\uFE0Fالوقفة الرابعة: الدوافع والأهداف:\n" +
                    "\n" +
                    "لما كانت القوة النووية هي آخر ما توصل إليه العالم من أسلحة الردع،خ والتسلط والقهر، يسعى الغرب إلى الحيلولة دون امتلاك غيرهم هذه القوة، باستثناء ربيبتهم الصهيونية التي أسسوها بالقوة على أراضي المسلمين المُغتصَبة؛ لتكون خنجرًا في خاصرة المنطقة، وذراعًا وكفيلًا لهم فيها، وهذا من مظاهر البغي والظلم، وتجاوز قوانين العدالة والمساواة التي نصوا عليها في مواثيق الأمم المتحدة؛ فالعقل والعدل يقتضيان التخلص من كل سلاح نووي في يد كل دولة كائنة ما كانت؛ حفاظًا على السلم والأمن الدوليين، أو أن يُترَك الناس وقدراتهم يتنافسون دون حجْر على أحد، أما أن يكون مباحًا لهم ومحرّمًا على غيرهم فهذا من مظاهر الظلم والطغيان، والانفلات من القوانين، والتنكر للمواثيق الدولية.\n" +
                    "\n" +
                    "\uD83D\uDC48 وهذه الازدواجية في المعايير، واتباع الأهواء في السياسة العالمية، لا يمكن أن يستقر معها العالم، بل سيظل في اضطراب دائم، وغليان مستمر، ولن يسلموا هم من غوائل اضطراباته، واختلال الحياة فيه. \n" +
                    "\n" +
                    "\uD83D\uDCA1 وعليه فإن الغرض الأصيل من العدوان الصهيوني هو ضرب القوة العسكرية الإيرانية عمومًا، ومباغتة القوة النووية الإيرانية خصوصًا قبل نضجها وتمامها، وتدمير مشروع إيران النووي؛ حتى لا يكون للصهاينة منافس في امتلاك القدرات العسكرية والقوة النووية.\n" +
                    "\n" +
                    "\uD83D\uDD18 وطرد هذا أن الصهاينة لو نجحوا في هذا الهدف سيكررون عدوانهم هذا على بلاد أخرى من بلاد المسلمين بعون أمريكي ومباركة غربية؛ {فَاعْتَبِرُوا يَاأُولِي الْأَبْصَارِ} [الحشر: ٢].  \n" +
                    "\n" +
                    "▫\uFE0Fالوقفة الخامسة: توصيف الحرب: \n" +
                    "\n" +
                    "الحرب التي نشبت بين دولة إيران، ودولة الكيان الصهيوني هي حرب (إسرا- أمريكية)، برضًا ومباركة غربية، وهي عدوان سافر من دولة الكيان الصهيوني على دولة إيران، وهو أمر محرم وفق ميثاق الأمم المتحدة، كما جاء في المادة الثانية الفقرات (3، 4)، وما تقوم به إيران هو دفاع مشروع وفق المادة (51) من ميثاق الأمم المتحدة؛ فهي حرب ظالمة بكل المقاييس، بينما الدولة الإيرانية تمارس حق الدفاع عن النفس، وهو أمر مشروع وفق مواثيق الأمم المتحدة، وهو مشروع وفق قوانين الشريعة الإسلامية، قال الله سبحانه: {فَمَنِ اعْتَدَى عَلَيْكُمْ فَاعْتَدُوا عَلَيْهِ بِمِثْلِ مَا اعْتَدَى عَلَيْكُم} [البقرة: ١٩٤].\n" +
                    "\n" +
                    "إذن وفق مواثيق الأمم المتحدة دولة الكيان الصهيوني معتدية يجب أن توقف عدوانها، وإن لم تفعل أوقفت بالقوة وفق المادة (42) من ميثاق الأمم المتحدة، وبما أن العالم يعيش فوضى لا تحكمها أي قوانين فإن المادة المذكورة لا تنفذ في دولة الكيان، لكن متى قامت دولة أخرى بأي عدوان مسلح فإن الظلمة والطغاة سيستنفرون الدول لمساعدتهم في ضرب المعتدي محتجين بذات المواد التي يعطلونها مئات المرات في حق الكيان الصهيوني ونظيراته ممن يوالونهم، فنحن أمام مجتمع دولي بلا أخلاق ولا عدالة ولا قوانين، تسيطر على قراراته دول قوية بمحض أهوائها، {فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ} [غافر: ١٢].\n" +
                    "\n" +
                    "\uD83D\uDC48 وبهذا تعلم أن هذه الحرب ليست حربًا دينية أو عقائدية، فاليهود لم يشنوا حربهم على الشيعة لأنهم أعداؤهم في الدين، بل إنهم يبغضون الدين السني، ويعادون الدول الإسلامية السنية أكثر بكثير من عداوتهم للشيعة، وتضمر لها السوء والشر، وتتحين الفرص لضربها، وإنما حقيقة الأمر أن هذه حرب مصالح، اتفقت فيها مصالح الكيان الصهيوني مع المصالح الغربية، وأن دولة إيران لا تقاتل نيابة المسلمين، ولا انتقامًا لأهل غزة، وإنما دفاعًا عن نفسها، ولكن حتمًا كل ضربة توجهها للعدو الصهيوني هي في مصلحة المسلمين عامة والفلسطينيين خاصة وإن كانت تأتي ضمنًا لا قصدًا.\n" +
                    "\n" +
                    "▫\uFE0Fالوقفة السادسة: التوصيف الفقهي:\n" +
                    "\n" +
                    "التوصيف الفقهي لهذه الحرب مبني على الأمور التالية:\n" +
                    "\n" +
                    "\uD83D\uDD16 أولًا: توصيف الجهتين المتحاربتين إيران والكيان الصهيوني:\n" +
                    "\n" +
                    "دولة الكيان الصهيوني تجتمع فيها ست من خصال الشر: \n" +
                    "\n" +
                    "١. أنها دولة يهودية كافرة.\n" +
                    "\n" +
                    "٢. ودولة حربية.\n" +
                    "\n" +
                    "٣. ودولة مغتصبة لبلاد المسلمين.\n" +
                    "\n" +
                    "٤. ودولة تشكل خطرًا وتهديدا للمنطقة بأسرها.\n" +
                    "\n" +
                    "٥. ودولة معتدية.\n" +
                    "\n" +
                    "٦. ودولة تمارس القتل والتهجير وأنواع التنكيل في حق المسلمين في فلسطين.\n" +
                    "\n" +
                    "\uD83D\uDC48 وبهذه الخصال قتالها واجب على المسلمين متى كانت لهم قدرة على ذلك، وراية متحدة. \n" +
                    "\n" +
                    "أما دولة إيران فهي: \n" +
                    "\n" +
                    "١. دولة تنتسب إلى الإسلام في الجملة.\n" +
                    "\n" +
                    "٢. ودولة شيعية رافضية إمامية، والرافضة طائفة بدعية ضالة ومنحرفة عن جادة الإسلام، ومن شدة انحرافها تكاد تكون ملة أخرى.\n" +
                    "\n" +
                    "٣. ونكّلت بالمسلمين في سوريا والعراق واليمن.\n" +
                    "\n" +
                    "٤. وتشكل خطرًا وتهديدًا على المنطقة العربية الإسلامية.\n" +
                    "\n" +
                    "\uD83D\uDCA1 وبمقارنة تلك الخصال في الدولتين يظهر بلا شك عندي أن اليهود أضلّ من الرافضة، وكفرهم بيّن واضح، وفوق الكفر هم حربيون، وزادوا على ذلك كونهم محتلين لبلاد المسلمين، ومعتدين.\n" +
                    "\n" +
                    "\uD83D\uDD16 ثانيًا: خطر الجهتين على بلاد المسلمين:\n" +
                    "\n" +
                    "كل من القوتين العسكريتين تمثل خطرًا على المسلمين والمنطقة خاصة، لكن أيهما أشد خطرًا وأكبر ضررًا؟\n" +
                    "\n" +
                    "هذا مقام قد تختلف فيه التقديرات حسب ما يعلمه كل أحد من أحوال الجهتين، والذي يظهر لي أن دولة الكيان الصهيوني أكبر ضررًا وأشد خطرًا، وتاريخهم أسود من تاريخ الروافض، ومكرهم وخبثهم يفوق ما لدى الشيعة، بجانب تصنيفهم دولة كافرة محاربة محتلة مغتصبة لبلاد المسلمين، كل هذا يجعل خطرهم أعظم وضررهم أكبر وأطم.\n" +
                    "\n" +
                    "\uD83D\uDD16 ثالثًا: أين تكمن مصلحة المسلمين؟\n" +
                    "\n" +
                    "الذي يظهر لي أن كسر كلا القوتين أو تدميرهما مصلحة ظاهرة لبلاد المسلمين، وهو السيناريو الأفضل لهم، وإن كان لا بد أن تنهزم إحدى القوتين، فهزيمة الكيان الصهيوني أقرب لمصالح المسلمين؛ لما فيها من كسر العدو الأكبر وإخماد شره، ودفع كثير من المفاسد عن بلاد المسلمين، وهذه مصالح عظمى تفوق المفاسد المتوقعة من دولة الرافضة، وقاعدة أهل العلم، تقديم المصلحة الأعلى على المفسدة الأقل مقارنة بها، كما أن هزيمة إيران أمام العدو الصهيوني تعد كارثة عظمى؛ لأنها ستتفرد بالقوة، ويصيبها الزهو والغرور، وتكرر عدوانها على دول أخرى من بلاد المسلمين؛ فيتفاقم الضرر ويعظم الخطر.\n" +
                    "\n" +
                    "▫\uFE0Fالوقفة السابعة: موقف المسلم:\n" +
                    "\n" +
                    "بالنظر إلى ما سبق ذكره من مصالح ومفاسد ومقارنة؛ يتضح أن المسلم يرجو إما كسر القوتين، أو انتصار إيران وهزيمة اليهود، وهذا متسق مع التعاطف الوجداني له، كما يشرع له الدعاء بكسر اليهود وهلاكهم وهزيمتهم، ولا شك عندي في جواز التعاطف الوجداني مع إيران لا مطلقًا وإنما على حساب العدو الصهيوني، والفرح بنصرة إيران وهزيمة اليهود، فيفرح المسلمون بانتصار إيران وكسر وهزيمة الدولة الصهيونية؛ إذ لا يلزم من فرحنا بنصرة إيران محبتنا لها ولا تمني نصرتها مطلقًا، وإنما حيث كانت في مقابل هزيمة من هم شر منها وأكثر ضررًا على المسلمين؛ إذ أهل الباطل ليسوا على حد سواء، ومن ثَمّ تتفاوت المواقف منهم مع اعتقاد حكمهم بحسبه من بدعة وكفر وفسق. \n" +
                    "\n" +
                    "\uD83D\uDC48 ومن هذا الباب فرح الصحابة بنصرة النصارى وهزيمة الوثنيين، ولم يعب عليهم الله عز وجل هذا الفرح في قوله تعالى: [غُلِبَتِ الرُّومُ * فِي أَدْنَى الْأَرْضِ وَهُمْ مِنْ بَعْدِ غَلَبِهِمْ سَيَغْلِبُونَ * فِي بِضْعِ سِنِينَ لِلَّهِ الْأَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ وَيَوْمَئِذٍ يَفْرَحُ الْمُؤْمِنُونَ * بِنَصْرِ اللَّهِ يَنْصُرُ مَنْ يَشَاءُ وَهُوَ الْعَزِيزُ الرَّحِيمُ [الروم:٢-٥ ]، جاء في حديث أبي سعيد رضي الله عنه قال: \"فَرِحَ الْمُؤْمِنُونَ بِظُهُورِ الرُّومِ عَلَى فَارِسَ\".\n" +
                    "\n" +
                    "\uD83D\uDCD6 خرجه الترمذي، وصححه الألباني.\n" +
                    "\n" +
                    "⏪ وقال ابن عباس رضي الله عنهما: \"غُلِبَتْ وَغَلَبَتْ، كَانَ الْمُشْرِكُونَ يُحِبُّونَ أَنْ يَظْهَرَ أَهْلُ فَارِسَ عَلَى الرُّومِ لأَنَّهُمْ وَإِيَّاهُمْ أَهْلُ أَوْثَانٍ، وَكَانَ الْمُسْلِمُونَ يُحِبُّونَ أَنْ يَظْهَرَ الرُّومُ عَلَى فَارِسَ لأَنَّهُمْ أَهْلُ كِتَابٍ\". \n" +
                    "\n" +
                    "\uD83D\uDCD6 خرجه أحمد والترمذي، وصححه الألباني.\n" +
                    "\n" +
                    "فالفرس والروم كلهم أهل كفر، ومع ذلك ودّ المسلمون نصرة الروم لأنهم أهل كتاب على الفرس الوثنيين، وفرحوا بنصرة الروم وهزيمة الفرس الوثنيين، قال ابن تيمية في الاستقامة (٤٦٣/١): \"لما اقتتلت فارس المجوس والروم النصارى وكان النبي صلى الله عليه وسلم بمكة إذ ذاك وهو في طائفة قليلة ممن آمن به كان هو وأصحابه يحبون أن تغلب الروم لأنهم أهل كتاب\"، فالصحابة ودوا وأحبوا نصرة النصارى في مقابل الوثنيين، وفرحوا بذلك، ولم يعتب عليهم ربهم سبحانه، وهو يعلم أن النصارى سيعتدون لاحقًا على المسلمين وهو ما جرى في الحروب الصليبية وغيرها، فاليهود شر من الرافضة، وأسوأ حالًا، وأعظم ضررًا لا ينبغي أن يماري في ذلك أحد، قال ابن عثيمين في مجموع فتاويه (٣٣٤/٢٥): \"لا بأس أن يفرح المؤمن بانتصار غير المسلم، ولو كان كافرًا\"، وقال: \"ربما يناصر هؤلاء على هؤلاء لكون أولئك أهون شرًا على المسلمين؛ وأقل خطرًا على دينهم لا لمحبته لظهورهم وانتصارهم على الإطلاق\".\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "هذا ما يظهر لي في هذه النازلة، والعلم عند الله تعالى، وصلى الله وسلم على رسول الله وآله وصحبه.\n" +
                    "\n" +
                    "______\n" +
                    "\n" +
                    "نشر بتاريخ: ٢٢ ذو الحجة ١٤٤٦هـ، الموافق 2025/6/18م\n" +
                    "\n" +
                    "════════❁══════\n" +
                    "\n" +
                    "\uD83D\uDCD9 خدمة فضيلة الشيخ الدكتور: حسن أحمد الهواري حفظه الله \uD83D\uDCD9\n" +
                    "\n" +
                    "════════❁══════\n" +
                    "\n" +
                    "\uD83D\uDCCC للاشتراك في الخدمة: أرسل ( اشتراك) إلى الرقم\n" +
                    "\n" +
                    "https://wa.me/249128388888\n" +
                    "\n" +
                    "أو الضغط على الرابط\n" +
                    "\n" +
                    "https://telegram.me/Dr_alhawary\n" +
                    "\n" +
                    "\uD83D\uDCCE انشر تؤجر بإذن الله \uD83D\uDCCE"
        )
    }
}
